app/controllers/products_controller.rb

  def create
  @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2015-06-01 02:30:29.962892"], ["updated_at", "2015-06-01 02:30:29.962892"]]